app/controllers/clientes_controller.rb

INSERT INTO "clientes" ("apellido", "correo", "created_at", "nombre", "rut", "telefono", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @cliente = Cliente.new(cliente_params)

    respond_to do |format|
      if @cliente.save