app/controllers/institucions_controller.rb

  def index
    @institucions = Institucion.all
---
SELECT "institucions".* FROM "institucions"

  def create
    @institucion = Institucion.new(institucion_params)

    respond_to do |format|
      if @institucion.save
---
INSERT INTO "institucions" ("created_at", "tienda", "updated_at") VALUES (?, ?, ?)  [["created_at", "2015-11-26 01:17:47.283722"], ["tienda", "la polar"], ["updated_at", "2015-11-26 01:17:47.283722"]]

    def set_institucion
      @institucion = Institucion.find(params[:id])
---
SELECT  "institucions".* FROM "institucions"  WHERE "institucions"."id" = ? LIMIT 1  [["id", 1]]