app/controllers/recla_institucions_controller.rb

  def index
    @recla_institucions = ReclaInstitucion.all
---
SELECT "recla_institucions".* FROM "recla_institucions"

  def create
    @recla_institucion = ReclaInstitucion.new(recla_institucion_params)
    @recla_institucion.save
---
INSERT INTO "recla_institucions" ("created_at", "institucion_id", "recla_id", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2015-11-26 01:18:21.299195"], ["institucion_id", 0], ["recla_id", 0], ["updated_at", "2015-11-26 01:18:21.299195"]]

    def set_recla_institucion
      @recla_institucion = ReclaInstitucion.find(params[:id])
---
SELECT  "institucions".* FROM "institucions"  WHERE "institucions"."id" = ? LIMIT 1  [["id", 0]]
SELECT  "recla_institucions".* FROM "recla_institucions"  WHERE "recla_institucions"."id" = ? LIMIT 1  [["id", 2]]