app/controllers/reclas_controller.rb

  def index
    @reclas = Recla.all
---
SELECT "reclas".* FROM "reclas"

  def create
    @recla = Recla.new(recla_params)

    respond_to do |format|
      if @recla.save
---
INSERT INTO "reclas" ("cliente_id", "created_at", "reclamo", "tienda", "updated_at") VALUES (?, ?, ?, ?, ?)  [["cliente_id", 16374529], ["created_at", "2015-11-26 01:11:04.136925"], ["reclamo", "mala atencion"], ["tienda", "la polar"], ["updated_at", "2015-11-26 01:11:04.136925"]]

  def update
    respond_to do |format|
      if @recla.update(recla_params)
---
UPDATE "reclas" SET "cliente_id" = ?, "updated_at" = ? WHERE "reclas"."id" = 1  [["cliente_id", 0], ["updated_at", "2015-11-26 01:11:37.377730"]]

    def set_recla
      @recla = Recla.find(params[:id])
---
SELECT  "reclas".* FROM "reclas"  WHERE "reclas"."id" = ? LIMIT 1  [["id", 1]]